Documents/ПоступлениеНаСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПоступлениеНаСчет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоРегиональнымСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеНаСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаПлатежаСписком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАванса</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДатыЗапретаИзменения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗапретаИзменения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеДатыЗапрета</Name>
					<Comment>Описание относительной даты запрета, используемое для вычисления даты запрета на текущую дату</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий к отдельной настройке запрета по пользователю/группу пользователей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыВнешнихПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыНазначенияДатЗапрета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПлатежиПоРеструктуризацииДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлатежиПоРеструктуризацииДолга</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеНаСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеНаСчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоСубсидиям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоЛьготам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоРегиональнымСубсидиям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеПоступления</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПланированиеАвансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПланированиеАвансов</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисленияБазыРаспределения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБазыРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаБазыРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеНаСчет/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтЛицевогоСчета Тогда
		
		Элементы.ЛицевойСчет.Видимость = Истина;
		Элементы.Контрагент.Видимость = Ложь;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.РасшифровкаПлатежаСписком.Видимость = Истина;
		Элементы.Услуга.Видимость = Ложь;
		
		Если Объект.РасшифровкаПлатежаСписком Тогда
			Элементы.Страницы.Видимость = Истина;
		Иначе
			Элементы.Страницы.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		Элементы.ЛицевойСчет.Видимость = Ложь;
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ДоговорКонтрагента.Видимость = Истина;
		Элементы.Страницы.Видимость = Ложь;
		Элементы.РасшифровкаПлатежаСписком.Видимость = Ложь;
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПрочиеПоступления Тогда
			Элементы.Услуга.Видимость = Ложь;
		ИНАЧЕ	
			Элементы.Услуга.Видимость = Истина;
		КонецЕсли; 	
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

// Функция помещает табличную часть РасшифровкаРасчетов во временное хранилище
// и возвращает адрес.
//
&НаСервере
Функция ПоместитьРасшифровкаПлатежаВХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.РасшифровкаПлатежа.Выгрузить(),
		УникальныйИдентификатор
	);
	
КонецФункции // ПоместитьРасшифровкаПлатежаВХранилище()

// Функция получает табличную часть РасшифровкаРасчетов из временного хранилища.
//
&НаСервере
Процедура ПолучитьРасшифровкаПлатежаИзХранилища(АдресРасшифровкаПлатежаВХранилище)
	
	ТаблицаРасшифровкаПлатежа = ПолучитьИзВременногоХранилища(АдресРасшифровкаПлатежаВХранилище);
	Объект.РасшифровкаПлатежа.Очистить();
	Для каждого СтрокаРасшифровкаПлатежа Из ТаблицаРасшифровкаПлатежа Цикл
		Строка = Объект.РасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаРасшифровкаПлатежа);
	КонецЦикла;
	
КонецПроцедуры // ПолучитьРасшифровкаПлатежаИзХранилища()

// Процедура заполняет расшифровку платежа.
//
&НаСервере
Процедура ЗаполнитьРасшифровкуПлатежа(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = Объект;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.ДатаЗапрета
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Раздел = ЗНАЧЕНИЕ(ПланВидовХарактеристик.РазделыДатЗапретаИзменения.Здания)
	|	И ДатыЗапретаИзменения.Объект = &Здание";
	
	Запрос.УстановитьПараметр("Здание", ТекущийОбъект.ЛицевойСчет.Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Период = Выборка.ДатаЗапрета;
	Иначе
		Период = ТекущийОбъект.Дата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетыПоЛицевымСчетамОстатки.Услуга,
	|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления КАК МесяцНачисления,
	|	РасчетыПоЛицевымСчетамОстатки.Организация,
	|	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК Сумма,
	|	РасчетыПоЛицевымСчетамОстатки.ПризнакАванса
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
	|		РасчетыПоЛицевымСчетамОстатки.МесяцНачисления КАК МесяцНачисления,
	|		ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|		РасчетыПоЛицевымСчетамОстатки.Организация КАК Организация,
	|		ЛОЖЬ КАК ПризнакАванса
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	|				,
	|				Организация = &Организация
	|					И ЛицевойСчет = &ЛицевойСчет
	|					И МесяцНачисления < &Период
	|					И МесяцНачисления > &ПустаяДата) КАК РасчетыПоЛицевымСчетамОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетам.Услуга,
	|		РасчетыПоЛицевымСчетам.МесяцНачисления,
	|		РасчетыПоЛицевымСчетам.Сумма,
	|		РасчетыПоЛицевымСчетам.Организация,
	|		ЛОЖЬ
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	|	ГДЕ
	|		РасчетыПоЛицевымСчетам.Регистратор = &Ссылка
	|		И РасчетыПоЛицевымСчетам.МесяцНачисления < &Период
	|		И РасчетыПоЛицевымСчетам.МесяцНачисления > &ПустаяДата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.Услуга,
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.МесяцНачисления,
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.СуммаОстаток,
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.Организация,
	|		ИСТИНА
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	|				,
	|				Организация = &Организация
	|					И ЛицевойСчет = &ЛицевойСчет
	|					И МесяцНачисления = &ПустаяДата) КАК РасчетыПоЛицевымСчетамОстаткиАвансы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетамАвансы.Услуга,
	|		РасчетыПоЛицевымСчетамАвансы.МесяцНачисления,
	|		РасчетыПоЛицевымСчетамАвансы.Сумма,
	|		РасчетыПоЛицевымСчетамАвансы.Организация,
	|		ИСТИНА
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетамАвансы
	|	ГДЕ
	|		РасчетыПоЛицевымСчетамАвансы.Регистратор = &Ссылка
	|		И РасчетыПоЛицевымСчетамАвансы.МесяцНачисления = &ПустаяДата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Услуга,
	|		&ПустаяДата,
	|		ПланированиеАвансовЛицевыеСчета.СуммаНачислено,
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Организация,
	|		ИСТИНА
	|	ИЗ
	|		Документ.ПланированиеАвансов.ЛицевыеСчета КАК ПланированиеАвансовЛицевыеСчета
	|	ГДЕ
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Организация = &Организация
	|		И ПланированиеАвансовЛицевыеСчета.ЛицевойСчет = &ЛицевойСчет
	|		И ПланированиеАвансовЛицевыеСчета.Ссылка.Дата >= &ДатаНач
	|		И ПланированиеАвансовЛицевыеСчета.Ссылка.Дата <= &ДатаКон
	|		И НЕ ПланированиеАвансовЛицевыеСчета.Ссылка.ПометкаУдаления) КАК РасчетыПоЛицевымСчетамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоЛицевымСчетамОстатки.Организация,
	|	РасчетыПоЛицевымСчетамОстатки.Услуга,
	|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления,
	|	РасчетыПоЛицевымСчетамОстатки.ПризнакАванса
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	МесяцНачисления,
	|	РасчетыПоЛицевымСчетамОстатки.Услуга.ВидУслуги.ПолеСортировки,
	|	РасчетыПоЛицевымСчетамОстатки.Услуга.ПолеСортировки";
	
	Запрос.УстановитьПараметр("Организация", ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("ЛицевойСчет", ТекущийОбъект.ЛицевойСчет);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ТекущийОбъект.Дата));
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	ТекущийОбъект.РасшифровкаПлатежа.Очистить();
	
	СуммаОсталосьРаспределить = ТекущийОбъект.СуммаДокумента;
	
	//ЗапросПоРеструктуризации
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(ПлатежиПоРеструктуризацииДолга.СуммаПлатежа, 0) КАК Сумма,
	|	ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаРасход, 0) КАК ОплченоВЭтомМесяце
	|ИЗ
	|	РегистрСведений.ПлатежиПоРеструктуризацииДолга КАК ПлатежиПоРеструктуризацииДолга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(&ДатаНач, &ДатаКон, , Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)) КАК РасчетыПоЛицевымСчетамОбороты
	|		ПО ПлатежиПоРеструктуризацииДолга.ЛицевойСчет = РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет
	|ГДЕ
	|	ПлатежиПоРеструктуризацииДолга.ЛицевойСчет = &ЛицевойСчет
	|	И ПлатежиПоРеструктуризацииДолга.Период = КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)";
	Запрос.УстановитьПараметр("ЛицевойСчет", ТекущийОбъект.ЛицевойСчет);
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ТекущийОбъект.Дата));
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Если Выборка.ОплченоВЭтомМесяце <> 0 Тогда
			Сумма = Выборка.Сумма - Выборка.ОплченоВЭтомМесяце;
			Если Сумма < 0 Тогда
				Сумма = 0;
			КонецЕсли;
		Иначе	 
			Сумма = Выборка.Сумма;
		КонецЕсли;
		
	Иначе 
		Сумма = 0;
	КонецЕсли;
	
	Пока СуммаОсталосьРаспределить > 0 Цикл
		
		НоваяСтрока = ТекущийОбъект.РасшифровкаПлатежа.Добавить();
		
		Если ВыборкаРезультатаЗапроса.Следующий() Тогда
			Если ВыборкаРезультатаЗапроса.Услуга = Справочники.Услуги.РеструктуризацияДолга  Тогда  //Сначала оплатим по реструктуризации
				Если Сумма <> 0 Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
					
					Если Сумма <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
						
						НоваяСтрока.Сумма = Сумма;
						СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - Сумма;
						
					Иначе // сумма остатка больше чем нужно распределить
						
						НоваяСтрока.Сумма =	СуммаОсталосьРаспределить;
						СуммаОсталосьРаспределить = 0;
						
					КонецЕсли;
				Иначе 
					ТекущийОбъект.РасшифровкаПлатежа.Удалить(НоваяСтрока.НомерСтроки-1);	
				КонецЕсли;
			Иначе
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
				
				Если ВыборкаРезультатаЗапроса.Сумма <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
					
					НоваяСтрока.Сумма = ВыборкаРезультатаЗапроса.Сумма;
					СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - ВыборкаРезультатаЗапроса.Сумма;
					
				Иначе // сумма остатка больше чем нужно распределить
					
					НоваяСтрока.Сумма =	СуммаОсталосьРаспределить;
					СуммаОсталосьРаспределить = 0;
					
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока.Сумма = СуммаОсталосьРаспределить;
			НоваяСтрока.ПризнакАванса = Истина;
			СуммаОсталосьРаспределить = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекущийОбъект.РасшифровкаПлатежа.Количество() = 0 Тогда
		ТекущийОбъект.РасшифровкаПлатежа.Добавить();
		ТекущийОбъект.РасшифровкаПлатежа[0].Сумма = Объект.СуммаДокумента;
		ТекущийОбъект.РасшифровкаПлатежа[0].ПризнакАванса = Истина;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьРасшифровкуПлатежа()

// Процедура - обработчик команды "Подбор".
//
&НаКлиенте
Процедура Подбор(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		Режим = РежимДиалогаВопрос.ОК;
		Вопрос(НСтр("ru='Укажите вначале лицевой счет!';uk='Укажіть спочатку особовий рахунок!'"), Режим, 0);
		Возврат;
	КонецЕсли;
	
	АдресРасшифровкаПлатежаВХранилище = ПоместитьРасшифровкаПлатежаВХранилище();
	
	ПараметрыПодбора = Новый Структура(
		"АдресРасшифровкаПлатежаВХранилище,
		|Организация,
		|Дата,
		|ЛицевойСчет,
		|Ссылка,
		|ВалютаДенежныхСредств,
		|СуммаДокумента",
		АдресРасшифровкаПлатежаВХранилище,
		Объект.Организация,
		Объект.Дата,
		Объект.ЛицевойСчет,
		Объект.Ссылка,
		ВалютаДенежныхСредств,
		Объект.СуммаДокумента
	);
		
	Результат = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораДолговПоЛицевымСчетам", ПараметрыПодбора);
	Если Результат = КодВозвратаДиалога.OK Тогда
		
		ПолучитьРасшифровкаПлатежаИзХранилища(АдресРасшифровкаПлатежаВХранилище);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды "ЗаполнитьРасшифровку".
//
&НаКлиенте
Процедура ЗаполнитьРасшифровку(Команда)
	
	Если Объект.СуммаДокумента = 0 Тогда
		Предупреждение(НСтр("ru='Укажите вначале сумму документа.';uk='Укажіть спочатку суму документа.'"));
		Возврат;
	КонецЕсли;
	
	Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
		Ответ = Вопрос(
			НСтр("ru='Расшифровка будет полностью перезаполнена. Продолжить?';uk='Розшифрування буде повністю перезаповнене. Продовжити?'"),
			РежимДиалогаВопрос.ДаНет
		);
			
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Объект.РасшифровкаПлатежа.Очистить();
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтЛицевогоСчета") Тогда
		
		ЗаполнитьРасшифровкуПлатежа();
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ВидОперации".
//
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "РасшифровкаПлатежаСписком".
//
&НаКлиенте
Процедура РасшифровкаПлатежаСпискомПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);

	ВалютаДенежныхСредств = Константы.ВалютаУчета.Получить();
	
	УстановитьВидимостьИДоступность();
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБанковскийСчетПоУмолчанию(Организация)
	
	Возврат Организация.БанковскийСчетПоУмолчанию;
	
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.БанковскийСчет = ПолучитьБанковскийСчетПоУмолчанию(Объект.Организация);	
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПризнакАвансаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТекущиеДанные.ПризнакАванса Тогда
		ТекущиеДанные.МесяцНачисления = '00010101';	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаМесяцНачисленияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущиеДанные.МесяцНачисления) Тогда
		ТекущиеДанные.ПризнакАванса = Ложь;	
	КонецЕсли; 
	
КонецПроцедуры
